stm32-rs/stm32f3xx-hal/src/pwm.rs
        pwm_timer_with_break!(
            tim1,
            TIM1,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim1rst,
            tim1en,
            [TIM1_CH1,TIM1_CH2,TIM1_CH3,TIM1_CH4],
            [PwmChannel,PwmChannel,PwmChannel,PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_n_channel!(TIM1, TIM1_CH1, u16, cc1e, cc1ne, ccr1, ccr);
        pwm_pin_for_pwm_n_channel!(TIM1, TIM1_CH2, u16, cc2e, cc2ne, ccr2, ccr);
        pwm_pin_for_pwm_n_channel!(TIM1, TIM1_CH3, u16, cc3e, cc3ne, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM1, TIM1_CH4, u16, cc4e, ccr4, ccr);

        //Pins
        pwm_channel_pin!(WithPins, TIM1, TIM1_CH1, output_to_pa8, PA8, AF6, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH1, output_to_pa7, PA7, AF6, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH1, output_to_pa11, PA11, AF6, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH1, output_to_pb13, PB13, AF6, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH1, output_to_pc13, PC13, AF4, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH2, output_to_pa9, PA9, AF6, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH2, output_to_pa12, PA12, AF6, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH2, output_to_pb0, PB0, AF6, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH2, output_to_pb14, PB14, AF6, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH3, output_to_pa10, PA10, AF6, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH3, output_to_pb1, PB1, AF6, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH3, output_to_pb15, PB15, AF4, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH3, output_to_pf0, PF0, AF6, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH3, output_to_pa11, PA11, AF11, ccmr2_output, oc4m, oc4pe);
    }
}

#[cfg(any(feature = "stm32f334", feature = "stm32f398"))]
macro_rules! tim1_ext1 {
    () => {
        pwm_channel_pin!(WithPins, TIM1, TIM1_CH1, output_to_pc0, PC0, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH2, output_to_pc1, PC1, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH3, output_to_pc2, PC2, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH4, output_to_pc3, PC3, AF2, ccmr2_output, oc4m, oc4pe);
    }
}

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
macro_rules! tim1_ext2 {
    () => {
        pwm_channel_pin!(WithPins, TIM1, TIM1_CH1, output_to_pe9, PE9, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH1, output_to_pe8, PE8, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH2, output_to_pe11, PE11, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH2, output_to_pe10, PE10, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH3, output_to_pe13, PE13, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithNPins, TIM1, TIM1_CH3, output_to_pe12, PE12, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM1, TIM1_CH3, output_to_pe14, PE14, AF2, ccmr2_output, oc4m, oc4pe);
    }
}

// TODO: stm32f301 has TIM1 with ext1
#[cfg(any(feature = "stm32f318", feature = "stm32f302", feature = "stm32f303", feature = "stm32f334", feature = "stm32f358", feature = "stm32f398"))]
tim1_common!();

#[cfg(any(feature = "stm32f334", feature = "stm32f398"))]
tim1_ext1!();

#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
tim1_ext2!();


// TIM2

pwm_timer_basic!(
    tim2,
    TIM2,
    u32,
    apb1enr,
    apb1rstr,
    pclk1,
    tim2rst,
    tim2en,
    [TIM2_CH1,TIM2_CH2,TIM2_CH3,TIM2_CH4],
    [PwmChannel,PwmChannel,PwmChannel,PwmChannel]
);

// Channels
pwm_pin_for_pwm_channel!(TIM2, TIM2_CH1, u32, cc1e, ccr1, ccr);
pwm_pin_for_pwm_channel!(TIM2, TIM2_CH2, u32, cc2e, ccr2, ccr);
pwm_pin_for_pwm_channel!(TIM2, TIM2_CH3, u32, cc3e, ccr3, ccr);
pwm_pin_for_pwm_channel!(TIM2, TIM2_CH4, u32, cc4e, ccr4, ccr);

// Pins
pwm_channel_pin!(WithPins, TIM2, TIM2_CH1, output_to_pa0, PA0, AF1, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM2, TIM2_CH1, output_to_pa5, PA5, AF1, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM2, TIM2_CH1, output_to_pa15, PA15, AF1, ccmr1_output, oc1m, oc1pe);
#[cfg(any(feature = "stm32f303", feature = "stm32f302", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM2, TIM2_CH1, output_to_pd3, PD3, AF2, ccmr1_output, oc1m, oc1pe);

pwm_channel_pin!(WithPins, TIM2, TIM2_CH2, output_to_pa1, PA1, AF1, ccmr1_output, oc2m, oc2pe);
pwm_channel_pin!(WithPins, TIM2, TIM2_CH2, output_to_pb3, PB3, AF1, ccmr1_output, oc2m, oc2pe);
#[cfg(any(feature = "stm32f303", feature = "stm32f302", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM2, TIM2_CH2, output_to_pd4, PD4, AF2, ccmr1_output, oc2m, oc2pe);

pwm_channel_pin!(WithPins, TIM2, TIM2_CH3, output_to_pa2, PA2, AF1, ccmr2_output, oc3m, oc3pe);
pwm_channel_pin!(WithPins, TIM2, TIM2_CH3, output_to_pa9, PA9, AF10, ccmr2_output, oc3m, oc3pe);
pwm_channel_pin!(WithPins, TIM2, TIM2_CH3, output_to_pb10, PB10, AF1, ccmr2_output, oc3m, oc3pe);
#[cfg(any(feature = "stm32f303", feature = "stm32f302", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM2, TIM2_CH3, output_to_pd7, PD7, AF2, ccmr2_output, oc3m, oc3pe);

pwm_channel_pin!(WithPins, TIM2, TIM2_CH4, output_to_pa3, PA3, AF1, ccmr2_output, oc4m, oc4pe);
pwm_channel_pin!(WithPins, TIM2, TIM2_CH4, output_to_pa10, PA10, AF1, ccmr2_output, oc4m, oc4pe);
pwm_channel_pin!(WithPins, TIM2, TIM2_CH4, output_to_pb11, PB11, AF1, ccmr2_output, oc4m, oc4pe);
#[cfg(any(feature = "stm32f303", feature = "stm32f302", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM2, TIM2_CH4, output_to_pd6, PD6, AF2, ccmr2_output, oc4m, oc4pe);


