stm32-rs/stm32f3xx-hal/src/pwm.rs
#[cfg(feature = "stm32f373")]
macro_rules! tim13 {
    () => {
        use crate::stm32::TIM13;

        /// Output Compare Channel 1 of Timer 13 (type state)
        pub struct TIM13_CH1 {}
        /// Output Compare Channel 2 of Timer 13 (type state)
        pub struct TIM13_CH2 {}
        /// Output Compare Channel 3 of Timer 13 (type state)
        pub struct TIM13_CH3 {}
        /// Output Compare Channel 4 of Timer 13 (type state)
        pub struct TIM13_CH4 {}

        pwm_timer_basic!(
            tim13,
            TIM13,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim13rst,
            tim13en,
            [TIM13_CH1],
            [PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM13, TIM13_CH1, u16, cc1e, ccr1, ccr);

        // Pins
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pa6, PA6, AF9, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pa9, PA9, AF2, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pb3, PB3, AF9, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM13, TIM13_CH1, output_to_pc4, PC4, AF2, ccmr1_output, oc1m, oc1pe);
    }
}

#[cfg(feature = "stm32f373")]
tim13!();


// TIM14

#[cfg(feature = "stm32f373")]
macro_rules! tim14 {
    () => {
        use crate::stm32::TIM14;

        /// Output Compare Channel 1 of Timer 14 (type state)
        pub struct TIM14_CH1 {}
        /// Output Compare Channel 2 of Timer 14 (type state)
        pub struct TIM14_CH2 {}
        /// Output Compare Channel 3 of Timer 14 (type state)
        pub struct TIM14_CH3 {}
        /// Output Compare Channel 4 of Timer 14 (type state)
        pub struct TIM14_CH4 {}

        pwm_timer_basic!(
            tim14,
            TIM14,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim14rst,
            tim14en,
            [TIM14_CH1],
            [PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM14, TIM14_CH1, u16, cc1e, ccr1, ccr);

        // Pins
        pwm_channel_pin!(WithPins, TIM14, TIM14_CH1, output_to_pa5, PA5, AF9, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM14, TIM14_CH1, output_to_pa7, PA7, AF9, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM14, TIM14_CH1, output_to_pa10, PA10, AF9, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM14, TIM14_CH1, output_to_pf9, PF9, AF2, ccmr1_output, oc1m, oc1pe);
    }
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim14!();


// TIM15

pwm_timer_with_break!(
    tim15,
    TIM15,
    u16,
    apb2enr,
    apb2rstr,
    pclk2,
    tim15rst,
    tim15en,
    [TIM15_CH1,TIM15_CH2],
    [PwmChannel,PwmChannel]
);

// Channels
pwm_pin_for_pwm_n_channel!(TIM15, TIM15_CH1, u16, cc1e, cc1ne, ccr1, ccr1);
pwm_pin_for_pwm_channel!(TIM15, TIM15_CH2, u16, cc2e, ccr2, ccr2);

// Pins
pwm_channel_pin!(WithPins, TIM15, TIM15_CH1, output_to_pa2, PA2, AF9, ccmr1_output, oc1m, oc1pe);
#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
pwm_channel_pin!(WithPins, TIM15, TIM15_CH1, output_to_pb6, PB6, AF9, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM15, TIM15_CH1, output_to_pb14, PB14, AF1, ccmr1_output, oc1m, oc1pe);
#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM15, TIM15_CH1, output_to_pf9, PF9, AF3, ccmr1_output, oc1m, oc1pe);

pwm_channel_pin!(WithNPins, TIM15, TIM15_CH1, output_to_pa1, PA1, AF9, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithNPins, TIM15, TIM15_CH1, output_to_pb15, PB15, AF2, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM15, TIM15_CH2, output_to_pa3, PA3, AF9, ccmr1_output, oc2m, oc2pe);
#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
pwm_channel_pin!(WithPins, TIM15, TIM15_CH2, output_to_pb7, PB7, AF9, ccmr1_output, oc2m, oc2pe);
pwm_channel_pin!(WithPins, TIM15, TIM15_CH2, output_to_pb15, PB15, AF2, ccmr1_output, oc2m, oc2pe);
#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM15, TIM15_CH2, output_to_pf10, PF10, AF3, ccmr1_output, oc2m, oc2pe);



// TIM16

pwm_timer_with_break!(
    tim16,
    TIM16,
    u16,
    apb2enr,
    apb2rstr,
    pclk2,
    tim16rst,
    tim16en,
    [TIM16_CH1],
    [PwmChannel]
);

// Channels
pwm_pin_for_pwm_n_channel!(TIM16, TIM16_CH1, u16, cc1e, cc1ne, ccr1, ccr1);

// Pins
pwm_channel_pin!(WithPins, TIM16, TIM16_CH1, output_to_pa9, PA6, AF1, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM16, TIM16_CH1, output_to_pa12, PA12, AF1, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM16, TIM16_CH1, output_to_pb4, PB4, AF1, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM16, TIM16_CH1, output_to_pb8, PB8, AF1, ccmr1_output, oc1m, oc1pe);
#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM16, TIM16_CH1, output_to_pe0, PE0, AF4, ccmr1_output, oc1m, oc1pe);

pwm_channel_pin!(WithNPins, TIM16, TIM16_CH1, output_to_pa13, PA13, AF1, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithNPins, TIM16, TIM16_CH1, output_to_pb6, PB6, AF1, ccmr1_output, oc1m, oc1pe);


// TIM17

pwm_timer_with_break!(
    tim17,
    TIM17,
    u16,
    apb2enr,
    apb2rstr,
    pclk2,
    tim17rst,
    tim17en,
    [TIM17_CH1],
    [PwmChannel]
);

// Channels
pwm_pin_for_pwm_n_channel!(TIM17, TIM17_CH1, u16, cc1e, cc1ne, ccr1, ccr1);

// Pins
pwm_channel_pin!(WithPins, TIM17, TIM17_CH1, output_to_pa7, PA7, AF1, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM17, TIM17_CH1, output_to_pb5, PB5, AF10, ccmr1_output, oc1m, oc1pe);
pwm_channel_pin!(WithPins, TIM17, TIM17_CH1, output_to_pb9, PB9, AF1, ccmr1_output, oc1m, oc1pe);
#[cfg(any(feature = "stm32f302", feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
pwm_channel_pin!(WithPins, TIM17, TIM17_CH1, output_to_pe1, PE1, AF4, ccmr1_output, oc1m, oc1pe);

pwm_channel_pin!(WithNPins, TIM17, TIM17_CH1, output_to_pa13, PA13, AF1, ccmr1_output, oc1m, oc1pe);


// TIM19

