stm32-rs/stm32f3xx-hal/src/pwm.rs
#[cfg(feature = "stm32f373")]
macro_rules! tim19 {
    () => {
        use crate::stm32::TIM19;

        /// Output Compare Channel 1 of Timer 19 (type state)
        pub struct TIM19_CH1 {}
        /// Output Compare Channel 2 of Timer 19 (type state)
        pub struct TIM19_CH2 {}
        /// Output Compare Channel 3 of Timer 19 (type state)
        pub struct TIM19_CH3 {}
        /// Output Compare Channel 4 of Timer 19 (type state)
        pub struct TIM19_CH4 {}

        pwm_timer_basic!(
            tim19,
            TIM19,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim19rst,
            tim19en,
            [TIM19_CH1,TIM19_CH2,TIM19_CH3,TIM19_CH4],
            [PwmChannel,PwmChannel,PwmChannel,PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH1, u16, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH2, u16, cc2e, ccr2, ccr);
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH3, u16, cc3e, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH4, u16, cc4e, ccr4, ccr);

        // Pins
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH1, output_to_pa0, PA0, AF11, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH1, output_to_pb6, PB6, AF11, ccmr1_output, oc1m, oc1pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH1, output_to_pc10, PC10, AF2, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithPins, TIM19, TIM19_CH2, output_to_pa1, PA1, AF11, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH2, output_to_pb7, PB7, AF11, ccmr1_output, oc2m, oc2pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH2, output_to_pc11, PC11, AF2, ccmr1_output, oc2m, oc2pe);

        pwm_channel_pin!(WithPins, TIM19, TIM19_CH3, output_to_pa2, PA2, AF11, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH3, output_to_pb8, PB8, AF11, ccmr2_output, oc3m, oc3pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH3, output_to_pc12, PC12, AF2, ccmr2_output, oc3m, oc3pe);

        pwm_channel_pin!(WithPins, TIM19, TIM19_CH4, output_to_pa3, PA3, AF11, ccmr2_output, oc4m, oc4pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH4, output_to_pb9, PB9, AF11, ccmr2_output, oc4m, oc4pe);
        pwm_channel_pin!(WithPins, TIM19, TIM19_CH4, output_to_pd0, PD0, AF2, ccmr2_output, oc4m, oc4pe);
    }
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim19!();


// TIM20
//
#[cfg(feature = "stm32f398")]
macro_rules! tim20 {
    () => {
        use crate::stm32::TIM20;

        /// Output Compare Channel 1 of Timer 20 (type state)
        pub struct TIM20_CH1 {}
        /// Output Compare Channel 2 of Timer 20 (type state)
        pub struct TIM20_CH2 {}
        /// Output Compare Channel 3 of Timer 20 (type state)
        pub struct TIM20_CH3 {}
        /// Output Compare Channel 4 of Timer 20 (type state)
        pub struct TIM20_CH4 {}

        pwm_timer_basic!(
            tim20,
            TIM20,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim20rst,
            tim20en,
            [TIM20_CH1,TIM20_CH2,TIM20_CH3,TIM20_CH4],
            [PwmChannel,PwmChannel,PwmChannel,PwmChannel]
        );

        // Channels
        // TODO: stm32f3 doesn't suppport registers for all 4 channels
        pwm_pin_for_pwm_n_channel!(TIM20, TIM20_CH1, u16, cc1e, cc1ne, ccr1, ccr1);

        //Pins
        pwm_channel_pin!(WithPins, TIM20, TIM20_CH1, output_to_pe2, PE2, AF6, ccmr1_output, oc1m, oc1pe);

        pwm_channel_pin!(WithNPins, TIM20, TIM20_CH1, output_to_pe4, PE4, AF6, ccmr1_output, oc1m, oc1pe);
    }
}

#[cfg(feature = "stm32f398")]
tim20!();
